### Terraform plan (stage)

```
Acquiring state lock. This may take a few moments...
module.sa.data.azuread_service_principal.github_oidc_sp: Reading...
module.sa.data.azuread_service_principal.github_oidc_sp: Read complete after 2s [id=/servicePrincipals/3d5ec6bd-a1ae-4014-a12d-0118cecd60f9]
module.rg.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/ee0be9cf-1cd4-4e1c-8f43-5bbec3127b77/resourceGroups/static-web-rg-stage]
module.sa.azurerm_storage_account.sa: Refreshing state... [id=/subscriptions/ee0be9cf-1cd4-4e1c-8f43-5bbec3127b77/resourceGroups/static-web-rg-stage/providers/Microsoft.Storage/storageAccounts/rushistaticsitesastage]
module.sa.azurerm_storage_account_static_website.sasw: Refreshing state... [id=/subscriptions/ee0be9cf-1cd4-4e1c-8f43-5bbec3127b77/resourceGroups/static-web-rg-stage/providers/Microsoft.Storage/storageAccounts/rushistaticsitesastage]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sa.azurerm_role_assignment.ra will be created
  + resource "azurerm_role_assignment" "ra" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3d5ec6bd-a1ae-4014-a12d-0118cecd60f9"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ee0be9cf-1cd4-4e1c-8f43-5bbec3127b77/resourceGroups/static-web-rg-stage/providers/Microsoft.Storage/storageAccounts/rushistaticsitesastage"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

<!-- tf-plan-aggregate -->
### Terraform plan (dev)

```
Acquiring state lock. This may take a few moments...
module.sa.data.azuread_service_principal.github_oidc_sp: Reading...
module.sa.data.azuread_service_principal.github_oidc_sp: Read complete after 2s [id=/servicePrincipals/3d5ec6bd-a1ae-4014-a12d-0118cecd60f9]
module.rg.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/ee0be9cf-1cd4-4e1c-8f43-5bbec3127b77/resourceGroups/static-web-rg-dev]
module.sa.azurerm_storage_account.sa: Refreshing state... [id=/subscriptions/ee0be9cf-1cd4-4e1c-8f43-5bbec3127b77/resourceGroups/static-web-rg-dev/providers/Microsoft.Storage/storageAccounts/rushistaticsitesadev]
module.sa.azurerm_storage_account_static_website.sasw: Refreshing state... [id=/subscriptions/ee0be9cf-1cd4-4e1c-8f43-5bbec3127b77/resourceGroups/static-web-rg-dev/providers/Microsoft.Storage/storageAccounts/rushistaticsitesadev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sa.azurerm_role_assignment.ra will be created
  + resource "azurerm_role_assignment" "ra" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3d5ec6bd-a1ae-4014-a12d-0118cecd60f9"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ee0be9cf-1cd4-4e1c-8f43-5bbec3127b77/resourceGroups/static-web-rg-dev/providers/Microsoft.Storage/storageAccounts/rushistaticsitesadev"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

### Terraform plan (prod)

```
Acquiring state lock. This may take a few moments...
module.sa.data.azuread_service_principal.github_oidc_sp: Reading...
module.sa.data.azuread_service_principal.github_oidc_sp: Read complete after 2s [id=/servicePrincipals/3d5ec6bd-a1ae-4014-a12d-0118cecd60f9]
module.rg.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/ee0be9cf-1cd4-4e1c-8f43-5bbec3127b77/resourceGroups/static-web-rg-prod]
module.sa.azurerm_storage_account.sa: Refreshing state... [id=/subscriptions/ee0be9cf-1cd4-4e1c-8f43-5bbec3127b77/resourceGroups/static-web-rg-prod/providers/Microsoft.Storage/storageAccounts/rushistaticsitesaprod]
module.sa.azurerm_storage_account_static_website.sasw: Refreshing state... [id=/subscriptions/ee0be9cf-1cd4-4e1c-8f43-5bbec3127b77/resourceGroups/static-web-rg-prod/providers/Microsoft.Storage/storageAccounts/rushistaticsitesaprod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sa.azurerm_role_assignment.ra will be created
  + resource "azurerm_role_assignment" "ra" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3d5ec6bd-a1ae-4014-a12d-0118cecd60f9"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ee0be9cf-1cd4-4e1c-8f43-5bbec3127b77/resourceGroups/static-web-rg-prod/providers/Microsoft.Storage/storageAccounts/rushistaticsitesaprod"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
